#include "global.h"

#define FILE_PREFIX "cubemain"
#define NAME_PREFIX "cm"

/*
Title 	Cubemain.txt File Guide
Description 	by Nefarius & Myhrginoc
Sent by 	
OVERVIEW:

This is the file that controls one of the most interesting aspect in the game that is used by the horadic cube (that you get from second quest in act 2).

RELATED .TXT FILES:

This file is using:

    ItemTypes.txt
    Misc.txt
    Armor.txt
    Weapons.txt
    Setitems.txt
    Uniqueitems.txt
    Properities.txt
    Itemstatscost.txt



COLUMN DESCRIPTIONS :

description 	This column has no function, it only serves as a comment field to make it easier to find specific recipes.
enabled 	Boolean, this controls if a recipe is active in-game, 1 stands for yes and 0 stands for no.
ladder 	Boolean, 1 if only allowed in ladder on realms (TBD) (Note: Also works for single player, tcp/ip)
min diff 	minimum game difficulty to use recipe (0 = all difficulties, 1 = Nightmare and hell, 2 = hell only).
version 	Tells the game if this is a old classic, new classic or expansion recipe, 0=old classic d2, 1=new classic d2 and 100 is expansion recipe. (*I am not sure if 1 is used in this file, but this column works the same way it works in all the other 
item related files so it probably does.)
op 	replaces realtime field, can now select requirement for allowing recipe (See Appendix A for more details)

19 stat value Valid recipe if (input1.stat.base >= value)
20 stat value Valid recipe if (input1.stat.base <= value)
21 stat value Valid recipe if (input1.stat.base != value)
22 stat value Valid recipe if (input1.stat.base == value)
23 stat value Valid recipe if (input1.stat.accr - input1.stat.base >= value)
24 stat value Valid recipe if (input1.stat.accr - input1.stat.base <= value)
25 stat value Valid recipe if (input1.stat.accr - input1.stat.base != value)
26 stat value Valid recipe if (input1.stat.accr - input1.stat.base == value)
27 x x pItem->OtherID != value
28 x x pItem->QuestDiff < ptGame->Diff (only checked if Quest and QuestDiffCheck are 1)
29->255 Free op code. 

*/

/*
所以此文件是描述方块的主要文件，也就是描述合成公式的文件。
此文件中的每一行表示一个合成公式。

description：注释，用来描述解释此公式的，可随便写。

Enabled：此公式是否可在游戏中使用。0代表不可使用，1代表可以使用。

Ladder：是否只能在天梯模式中使用。0代表不是，1代表是。单机版不受此列影响，所以可不填。

min diff：使用此公式所需要的最低游戏难度。0代表普通，1代表恶梦，2代表地狱。

version：使用此公式所需要的最低游戏版本。0 代表原版本， 1 代表新版本，100 代表扩展任务（即“毁灭之王”）。

op：使用此公式的特殊效果或特殊条件。如28表示使用此公式时显示合成光芒。

param：op列的参数。

value：op列的参数。

class：使用此公式的角色职业限制。

numinputs：参与此公式合成的所有物品总数。

input1：此公式的主材料。如物品升级时一定要将待升级物品作为主要材料，即input1才行。后面会解释原因。

input2-7：此公式的附属材料。

output：此合成公式的第一个合成结果。

lvl：第一个合成结果的物品等级。若不填则使用紧跟的qlvl和ilvl决定合成结果的物品等级。若此列有值则qlvl和ilvl列无效。

qlvl：角色等级对合成结果物品等级的影响因子。

ilvl：此公式的主材料的物品等级对合成结果物品等级的影响因子。
若lvl列为空，则合成结果的物品等级为 [ [角色等级 * qlvl / 100] + [主材料物品等级 * ilvl / 100] ]。此式子中的方括号表示向下取整。
所以对于橙色物品的合成来说，qlvl=ilvl=50。所以一个99级的角色使用99级的装备作为主材料，合成出的橙色物品的等级为 2 * [99 * 50 / 100] = 2 * [49.5] = 2 * 49 = 98。

mod 1-5：第一个结果的第1-5个属性。与Properties.txt关联。

mod 1-5 chance：出现第1-5个属性的概率。

mod 1-5 param：第1-5个属性的参数。

mod 1-5 min：第1-5个属性的最小值参数。

mod 1-5 max：第1-5个属性的最大值参数。

output b：此合成公式的第二个合成结果。

以后28列的含义都是对合成公式的第二个合成结果的描述，请参考第一个合成结果的解释。

output c：此合成公式的第三个合成结果。

以后28列的含义都是对合成公式的第三个合成结果的描述，请参考第一个合成结果的解释。

*eol：行尾标志，必须填0。

特殊说明1：合成时游戏只会记录参与合成的主材料的信息，如装备类型、品质、物品等级之类的，自己编写新的公式时一定要注意这点。

特殊说明2：当合成结果所占的空间超过方块本身的大小时，则造成空间超出的合成结果将消失。

特殊说明3：
op列的值及其后param和Value的使用说明。
op Param Value 实际效果
1 x day 当前日期(时间？)大于给定参数时Cube配方有效
2 x 日期 当前日期等于给定参数时配方有效(0=星期天 等等 ...)
3 stat value 当前状态大于等于给定参数时配方有效
4 stat value 当前状态小于等于给定参数时配方有效
5 stat value 当前状态不等于给定参数时配方有效
6 stat value 当前状态等于给定参数时配方有效
7 stat value 基础状态小于等于给定参数时配方有效
8 stat value 基础状态大于等于给定参数时配方有效
9 stat value 基础状态不等于给定参数时配方有效
10 stat value 基础状态等于给定参数时配方有效
11 ? ? ?
12 ? ? ?
13 ? ? ?
14 ? ? ?
15 stat value input1当前状态小于等于给定参数时配方有效
16 stat value input1当前状态大于等于给定参数时配方有效
17 stat value input1当前状态不等于给定参数时配方有效
18 stat value input1当前状态等于给定参数时配方有效
19->27 闲置Op.
28 x x 显示合成时候的光芒.
29->255 闲置Op.

此部分摘录自Sloovy的发言，本人没有进行验证。

最后我再说明一下，如果大家想不失去最初合成用的原始物品；可以将 output b换成无变更的原始物品。
比如说：1怀特之腿+1回城魔法书=隐藏奶牛关；如果我想在生成牛关后继续拥有回城魔法书，可以在output b中输入tbk，并且不做任何的属性及参数调整，即可。


击中敌人时 5%机会 施展 等级5 伤害加深
这代码怎么填？
gethit-skill是这技能的代码！Amplefy Damage是伤害加深！
5个格子！该如何填？

gethit是被击中时，hit-skill是击中敌人时。
code（prop) = hit-skill
param = Amplify Damage 或 66
min = 5
max = 5
我应该在Properties.txt文件解析中提到过

struct D2CubeInputItem
{
   BYTE nInputFlags;               //0x00
   BYTE nItemType;                  //0x01
   WORD wItem;                     //0x02
   WORD wItemID;                  //0x04
   BYTE nQuality;                  //0x06
   BYTE nQuantity;                  //0x07
};


struct D2CubeOutputItem
{
   BYTE nItemFlags;               //0x00
   BYTE nItemType;                  //0x01
   WORD wItem;                     //0x02
   WORD wItemID;                  //0x04
   BYTE nQuality;                  //0x06
   BYTE nQuantity;                  //0x07
   BYTE nType;                     //0x08
   BYTE nLvl;                     //0x09
   BYTE nPLvl;                     //0x0A
   BYTE nILvl;                     //0x0B
   WORD wPrefixId;                  //0x0C
   WORD unk0x0E;                  //0x0E
   WORD unk0x10;                  //0x10
   WORD wSuffixId;                  //0x12
   DWORD unk0x14;                  //0x14
   struct
   {
      DWORD   dwMod;         //0x00
      WORD   wModParam;      //0x04
      WORD   wModMin;      //0x06
      WORD   wModMax;      //0x08
      WORD   wModChance;      //0x0A
   } sMods[5];                   //0x18
};
*/

typedef struct
{//total 328 bytes
    unsigned char venabled;
    unsigned char vladder;
    unsigned char vminmyspdiff;
    unsigned char vclass;   //playerclass

    unsigned int vop;
    unsigned int vparam;
    unsigned int vvalue;

    unsigned short vnuminputs;
    unsigned short vversion;

    unsigned char vinputmysp1[8];

    unsigned char vinputmysp2[8];

    unsigned char vinputmysp3[8];

    unsigned char vinputmysp4[8];

    unsigned char vinputmysp5[8];

    unsigned char vinputmysp6[8];

    unsigned char vinputmysp7[8];

    unsigned char voutput[20];  //lvl、plvl、ilvl复用在这20个byte里

    unsigned int iPadding24;

    unsigned int vmodmysp1;   //properties

    unsigned short vmodmysp1myspparam;
    short vmodmysp1myspmin;

    short vmodmysp1myspmax;
    unsigned short vmodmysp1myspchance;

    unsigned int vmodmysp2;   //properties

